Revit 2024 API
BuiltInFailures.WallFailures.ContFootingRadiusTooSmall Property
 Can't display the Wall Foundation, because the Wall's radius is too small. Please increase the radius to display the Wall Foundation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ContFootingRadiusTooSmall { get; }
Visual Basic
Public Shared ReadOnly Property ContFootingRadiusTooSmall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ContFootingRadiusTooSmall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace